In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame()

In [3]:
df

Empty DataFrame
Columns: []
Index: []

In [4]:
type(df)

pandas.core.frame.DataFrame

In [26]:
data = [['ABC',1],['XYZ',2],['MNO',3]]
data2 = [1,'Aditya',2,'Papal']

In [27]:
df2 = pd.DataFrame(data)

In [28]:
df2

     0  1
0  ABC  1
1  XYZ  2
2  MNO  3

In [29]:
pd.DataFrame(data2)

        0
0       1
1  Aditya
2       2
3   Papal

In [33]:
# using list we create dataframe

In [34]:
new_data = [['ABC',20],['XYZ',21],['MNO',29]]

In [35]:
df = pd.DataFrame(new_data,columns=['Names','Age'])

In [36]:
df

  Names  Age
0   ABC   20
1   XYZ   21
2   MNO   29

In [37]:
# Using dictionary we create dataframe

In [38]:
data2 = {"Name":['ABC','MNO','XYZ'],'Age':[22,27,23]}

In [58]:
df2 = pd.DataFrame(data2,index=[10,20,30])

In [59]:
df2

   Name  Age
10  ABC   22
20  MNO   27
30  XYZ   23

In [53]:
data3 = [{'col1':20,'col2':32,'col3':34},{'col1':34,'col3':44}]

In [43]:
df3 = pd.DataFrame(data3)

In [44]:
df3

   col1  col2  col3
0    20  32.0    34
1    34   NaN    44

In [48]:
df3['col2'].dtype,df3['col1'].dtype

(dtype('float64'), dtype('int64'))

In [60]:
data='''{
    
    "name":"sunny savita",
      "phone_no":734523979,
      "company_name":["xyz","abc","123"]

}'''

In [61]:
import json
d=json.loads(data)

In [62]:
d

{'name': 'sunny savita',
 'phone_no': 734523979,
 'company_name': ['xyz', 'abc', '123']}

In [63]:
type(d)

dict

In [64]:
pd.DataFrame(d)

           name   phone_no company_name
0  sunny savita  734523979          xyz
1  sunny savita  734523979          abc
2  sunny savita  734523979          123

In [66]:
df = pd.read_csv("https://raw.githubusercontent.com/sunnysavita10/Statistics-With-Python-TheCompleteGuide/main/googleplaystore.csv")

In [67]:
df

,App,Category,Rating,Reviews,Size,Installs,Type,Price,Content Rating,Genres,Last Updated,Current Ver,Android Ver
0,Photo Editor & Candy Camera & Grid & ScrapBook,ART_AND_DESIGN,4.1,159,19M,"10,000+",Free,0,Everyone,Art & Design,"January 7, 2018",1.0.0,4.0.3 and up
1,Coloring book moana,ART_AND_DESIGN,3.9,967,14M,"500,000+",Free,0,Everyone,Art & Design;Pretend Play,"January 15, 2018",2.0.0,4.0.3 and up
2,"U Launcher Lite – FREE Live Cool Themes, Hide ...",ART_AND_DESIGN,4.7,87510,8.7M,"5,000,000+",Free,0,Everyone,Art & Design,"August 1, 2018",1.2.4,4.0.3 and up
3,Sketch - Draw & Paint,ART_AND_DESIGN,4.5,215644,25M,"50,000,000+",Free,0,Teen,Art & Design,"June 8, 2018",Varies with device,4.2 and up
4,Pixel Draw - Number Art Coloring Book,ART_AND_DESIGN,4.3,967,2.8M,"100,000+",Free,0,Everyone,Art & Design;Creativity,"June 20, 2018",1.1,4.4 and up
...,...,...,...,...,...,...,...,...,...,...,...,...,...
10836,Sya9a Maroc - FR,FAMILY,4.5,38,53M,"5,000+",Free,0,Everyone,Education,"July 25, 2017",1.48,4.1 and up
10837,Fr. Mike Schmitz Audio Teachings,FAMILY,5.0,4,3.6M,100+,Free,0,Everyone,Education,"July 6, 2018",1.0,4.1 and up
10838,Parkinson Exercices FR,MEDICAL,NaN,3,9.5M,"1,000+",Free,0,Everyone,Medical,"January 20, 2017",1.0,2.2 and up
10839,The SCP Foundation DB fr nn5n,BOOKS_AND_REFERENCE,4.5,114,Varies with device,"1,000+",Free,0,Mature 17+,Books & Reference,"January 19, 2015",Varies with device,Varies with device
10840,iHoroscope - 2018 Daily Horoscope & Astrology,LIFESTYLE,4.5,398307,19M,"10,000,000+",Free,0,Everyone,Lifestyle,"July 25, 2018",Varies with device,Varies with device

In [68]:
df.head()

,App,Category,Rating,Reviews,Size,Installs,Type,Price,Content Rating,Genres,Last Updated,Current Ver,Android Ver
0,Photo Editor & Candy Camera & Grid & ScrapBook,ART_AND_DESIGN,4.1,159,19M,"10,000+",Free,0,Everyone,Art & Design,"January 7, 2018",1.0.0,4.0.3 and up
1,Coloring book moana,ART_AND_DESIGN,3.9,967,14M,"500,000+",Free,0,Everyone,Art & Design;Pretend Play,"January 15, 2018",2.0.0,4.0.3 and up
2,"U Launcher Lite – FREE Live Cool Themes, Hide ...",ART_AND_DESIGN,4.7,87510,8.7M,"5,000,000+",Free,0,Everyone,Art & Design,"August 1, 2018",1.2.4,4.0.3 and up
3,Sketch - Draw & Paint,ART_AND_DESIGN,4.5,215644,25M,"50,000,000+",Free,0,Teen,Art & Design,"June 8, 2018",Varies with device,4.2 and up
4,Pixel Draw - Number Art Coloring Book,ART_AND_DESIGN,4.3,967,2.8M,"100,000+",Free,0,Everyone,Art & Design;Creativity,"June 20, 2018",1.1,4.4 and up

In [69]:
df.shape

(10841, 13)

In [70]:
df.dtypes

App                object
Category           object
Rating            float64
Reviews            object
Size               object
Installs           object
Type               object
Price              object
Content Rating     object
Genres             object
Last Updated       object
Current Ver        object
Android Ver        object
dtype: object

In [74]:
data = [['sunny', 26, 'data scientist', '15K'],
       ['manish', 38, 'ml engineering', '25K'],
       ['raj', 27, 'cv engineering', '35K'],
       ['archana', 27, 'data analytics', '30K'],
       ['priya', 28, 'cloud engineer', '27K']]

In [78]:
df2 = pd.DataFrame(data,columns=['Name','Age','Domain','Salary'])

In [79]:
df2

      Name  Age          Domain Salary
0    sunny   26  data scientist    15K
1   manish   38  ml engineering    25K
2      raj   27  cv engineering    35K
3  archana   27  data analytics    30K
4    priya   28  cloud engineer    27K

In [81]:
df2.axes

[RangeIndex(start=0, stop=5, step=1),
 Index(['Name', 'Age', 'Domain', 'Salary'], dtype='object')]

In [84]:
# apply function

In [85]:
import numpy as np

In [86]:
dataframe = pd.DataFrame(np.random.randn(5,3),columns=["col1","col2","col3"])

In [87]:
dataframe

       col1      col2      col3
0 -0.454657 -0.167143  0.763204
1 -0.742122 -0.670084 -1.332338
2 -0.755077 -0.490273 -1.898921
3 -1.325597 -0.085369 -0.920235
4  0.486620  0.389101 -0.123515

In [88]:
dataframe.apply(np.mean)

col1   -0.558167
col2   -0.204754
col3   -0.702361
dtype: float64

In [89]:
dataframe.apply(np.median)

col1   -0.742122
col2   -0.167143
col3   -0.920235
dtype: float64

In [90]:
dataframe.apply(lambda x:x.max())

col1    0.486620
col2    0.389101
col3    0.763204
dtype: float64

In [91]:
dataframe.apply(lambda x:x.min())

col1   -1.325597
col2   -0.670084
col3   -1.898921
dtype: float64

In [92]:
dataframe.apply(lambda x:x.max()-x.min())

col1    1.812217
col2    1.059185
col3    2.662125
dtype: float64